Тест/Тест/src/Documents/ПрочиеДоходы/ПрочиеДоходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрочиеДоходы</name>
  <basedOn>Document.ПоступлениеЗапчастей</basedOn>
  <registerRecords>AccumulationRegister.Баланс</registerRecords>
  <registerRecords>AccumulationRegister.ДвижениеТМЦВорктрак</registerRecords>
  <attributes>
    <name>ВидДохода</name>
    <type>
      <types>EnumRef.ВидыПрочихДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПлатежа</name>
    <type>
      <types>EnumRef.ПериодПлатежа</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействующийДоговор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПродажиТМЦ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокументаАренда</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТМЦИмущество</name>
    <type>
      <types>CatalogRef.ТМЦВорктрак</types>
    </type>
  </attributes>
  <attributes>
    <name>СотрудникКлиент</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>EnumRef.ТипОплатыПрочиеДоходы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТМЦ</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>CatalogRef.ТМЦВорктрак</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИнвентарныйНомер</name>
      <type>
        <types>CatalogRef.ИнвентарныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоХраненияТМЦ</name>
      <type>
        <types>CatalogRef.МестаХраненияТМЦ</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Код</name>
      <type>
        <types>CatalogRef.ТМЦВорктрак</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест/Тест/src/AccumulationRegisters/Баланс/Баланс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Баланс</name>
  <resources>
    <name>Баланс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Измерение1</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тест/Тест/src/AccumulationRegisters/ДвижениеТМЦВорктрак/ДвижениеТМЦВорктрак.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДвижениеТМЦВорктрак</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ТМЦ</name>
    <type>
      <types>CatalogRef.ТМЦВорктрак</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХраненияТМЦ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>CatalogRef.ИнвентарныеНомера</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тест/Тест/src/Documents/ПрочиеДоходы/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)
	// регистр Баланс
	Движения.Баланс.Записывать = Истина;
	Движение = Движения.Баланс.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Измерение1 = Счет;
	Движение.Баланс = СуммаПлатежа;

	// регистр ДвижениеТМЦВорктрак
	Движения.ДвижениеТМЦВорктрак.Записывать = Истина;
	Для Каждого ТекСтрокаТМЦ из ТМЦ Цикл
		Движение = Движения.ДвижениеТМЦВорктрак.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.ТМЦ = ТекСтрокаТМЦ.Наименование;
		Движение.МестоХранения = ТекСтрокаТМЦ.МестоХраненияТМЦ;
		Движение.ИнвентарныйНомер = ТекСтрокаТМЦ.ИнвентарныйНомер;
		Движение.Количество = ТекСтрокаТМЦ.Количество;
		Движение.Цена = ТекСтрокаТМЦ.Стоимость;
	КонецЦикла;
КонецПроцедуры 

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
			Возврат;
	КонецЕсли;
	
	Если ПроверкаНаДублиВТаблицеТМЦ()  тогда 
		Сообщить (" Ошибка, в таблице ТМЦ есть Дубли");
		Отказ  = Истина; 
		Возврат; 
//	ИначеЕСли ПроверкаОстатков() Тогда 
//		Сообщить (" Ошибка, недостаточное колличество");
//		Отказ  = Истина;
	КонецЕсли; 
КонецПроцедуры

Функция ПроверкаОстатков() 

	МассивИндкодов = Новый массив; 
	КоличествоОстаток = 0; 
	ФлагОстановкиЗаписи = ложь;
	  
	Для каждого Строка из ТМЦ Цикл 
		 КоличествоОстаток = ПроверкаОстатковЗапрос(Строка.ИнвентарныйНомер); 
		 Если КоличествоОстаток < Строка.Количество  Тогда 
		 	ФлагОстановкиЗаписи = Истина; 
		 	Возврат ФлагОстановкиЗаписи; 
		 	КонецЕсли;  
	конецЦикла;
	Возврат ФлагОстановкиЗаписи; 
КонецФункции

 Функция ПроверкаОстатковЗапрос(ИндКод)
 	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДвижениеТМЦВорктракОстатки.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ДвижениеТМЦВорктракОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ДвижениеТМЦВорктрак.Остатки КАК ДвижениеТМЦВорктракОстатки
		|ГДЕ
		|	ДвижениеТМЦВорктракОстатки.ИнвентарныйНомер = &ИнвентарныйНомер";
	
	Запрос.УстановитьПараметр("ИнвентарныйНомер", ИндКод);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	КоличествоОстаток = 0; 
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КоличествоОстаток = ВыборкаДетальныеЗаписи. КоличествоОстаток; 
	КонецЦикла;
 	
 	Возврат КоличествоОстаток;
 	 	 
 КонецФункции 
   
   Функция ПроверкаНаДублиВТаблицеТМЦ() 
	ИндНомер = "";
	ФлагОстановки= Ложь; 
	Для каждого Строка из ТМЦ Цикл 
		 
			Если ИндНомер = Строка.ИнвентарныйНомер Тогда 
				ФлагОстановки = истина; 
				Возврат ФлагОстановки ; 
			Иначе ИндНомер = Строка.ИнвентарныйНомер; 
			КонецЕсли; 
			
	конецЦикла; 
	Возврат ФлагОстановки; 
КонецФункции

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеЗапчастей") Тогда

		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ПоступлениеЗапчастейТМЦ.Ссылка,
			|	ПоступлениеЗапчастейТМЦ.НомерСтроки,
			|	ПоступлениеЗапчастейТМЦ.Артикул,
			|	ПоступлениеЗапчастейТМЦ.Количество,
			|	ПоступлениеЗапчастейТМЦ.Товар,
			|	ПоступлениеЗапчастейТМЦ.Цена,
			|	ПоступлениеЗапчастейТМЦ.Сумма,
			|	ПоступлениеЗапчастейТМЦ.Склад,
			|	ПоступлениеЗапчастейТМЦ.ТипУчетаТМЦ,
			|	ПоступлениеЗапчастейТМЦ.Бренд,
			|	ПоступлениеЗапчастейТМЦ.Сотрудник
			|ИЗ
			|	Документ.ПоступлениеЗапчастей.ТМЦ КАК ПоступлениеЗапчастейТМЦ
			|ГДЕ
			|	ПоступлениеЗапчастейТМЦ.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяСтрока = ТМЦ.Добавить();
			
			НоваяСтрока.Наименование		= ВыборкаДетальныеЗаписи.Товар;
			НоваяСтрока.Количество			= ВыборкаДетальныеЗаписи.Количество; 
			НоваяСтрока.Сумма				= ВыборкаДетальныеЗаписи.Сумма; 
			НоваяСтрока.Стоимость			= ВыборкаДетальныеЗаписи.Цена; 
			НоваяСтрока.ИнвентарныйНомер	= ВыборкаДетальныеЗаписи.Ссылка; 
//			НоваяСтрока.МестоХраненияТМЦ	= ВыборкаДетальныеЗаписи.
			НоваяСтрока.Сотрудник			= ВыборкаДетальныеЗаписи.Сотрудник; 
			НоваяСтрока.Код					= ВыборкаДетальныеЗаписи.Товар.код; 
		КонецЦикла;

	
			
	КонецЕсли; 
		
КонецПроцедуры
